gw826943555/hal_gigadevice/gd32f527/standard_peripheral/include/gd32f527_fmc.h
/* FMC_STAT */
#define FMC_STAT_END                   BIT(0)                                          /*!< end of operation flag bit */
#define FMC_STAT_OPERR                 BIT(1)                                          /*!< flash operation error flag bit */
#define FMC_STAT_LDECCDET              BIT(2)                                          /*!< two bits ECC error when load code from flash/OTP1/bootloader */
#define FMC_STAT_WPERR                 BIT(4)                                          /*!< erase/Program protection error flag bit */
#define FMC_STAT_PGAERR                BIT(5)                                          /*!< Program alignment error flag bit */
#define FMC_STAT_PGMERR                BIT(6)                                          /*!< program size not match error flag bit */
#define FMC_STAT_PGSERR                BIT(7)                                          /*!< program sequence error flag bit */
#define FMC_STAT_RDCERR                BIT(8)                                          /*!< CBUS data read protection error flag bit */
#define FMC_STAT_BUSY                  BIT(16)                                         /*!< flash busy flag bit */

/* FMC_CTL */
#define FMC_CTL_PG                     BIT(0)                                          /*!< main flash program command bit */
#define FMC_CTL_SER                    BIT(1)                                          /*!< main flash sector erase command bit */
#define FMC_CTL_MER0                   BIT(2)                                          /*!< main flash mass erase for bank0 command bit */
#define FMC_CTL_SN                     BITS(3,7)                                       /*!< select which sector number to be erased */
#define FMC_CTL_PSZ                    BITS(8,9)                                       /*!< program size bit */
#define FMC_CTL_DWPGE                  BIT(10)                                         /*!< double word Program size bit enable bit */
#define FMC_CTL_SN_5                   BIT(11)                                         /*!< bit 5 of SN */
#define FMC_CTL_MER1                   BIT(15)                                         /*!< main flash mass erase for bank1 command bit */
#define FMC_CTL_START                  BIT(16)                                         /*!< send erase command to FMC bit */
#define FMC_CTL_ENDIE                  BIT(24)                                         /*!< end of operation interrupt enable bit */
#define FMC_CTL_ERRIE                  BIT(25)                                         /*!< error interrupt enable bit */
#define FMC_CTL_LDECCIE                BIT(26)                                         /*!< load code ECC error interrupt enable bit */
#define FMC_CTL_NWLDE                  BIT(29)                                         /*!< No wait time area load enable when system reset */
#define FMC_CTL_RLBP                   BIT(30)                                         /*!< Read lock block protection for OTP2 */
#define FMC_CTL_LK                     BIT(31)                                         /*!< FMC_CTL lock bit */

/* FMC_OBCTL0 */
#define FMC_OBCTL0_OB_LK               BIT(0)                                          /*!< FMC_OBCTL0 lock bit */
#define FMC_OBCTL0_OB_START            BIT(1)                                          /*!< send option byte change command to FMC bit */
#define FMC_OBCTL0_BOR_TH              BITS(2,3)                                       /*!< option byte BOR threshold value */
#define FMC_OBCTL0_BB                  BIT(4)                                          /*!< option byte boot bank value */
#define FMC_OBCTL0_NWDG_HW             BIT(5)                                          /*!< option byte watchdog value */
#define FMC_OBCTL0_NRST_DPSLP          BIT(6)                                          /*!< option byte deepsleep reset value */
#define FMC_OBCTL0_NRST_STDBY          BIT(7)                                          /*!< option byte standby reset value */
#define FMC_OBCTL0_SPC                 BITS(8,15)                                      /*!< option byte Security Protection code */
#define FMC_OBCTL0_WP0                 BITS(16,27)                                     /*!< erase/program protection of low 12 sectors of bank0 when DRP is 0 */
#define FMC_OBCTL0_ECCEN               BIT(28)                                         /*!< ECC enable bit */
#define FMC_OBCTL0_NWA                 BIT(29)                                         /*!< no waiting time area select bit */
#define FMC_OBCTL0_DRP                 BIT(31)                                         /*!< CBUS read protection bit */

/* FMC_OBCTL1 */
#define FMC_OBCTL1_WP0_H               BITS(0,7)                                       /*!< erase/program protection of high 8 sectors of bank0 when DRP is 0 */
#define FMC_OBCTL1_WP1_H               BITS(8,15)                                      /*!< erase/program protection of high 8 sectors of bank1 when DRP is 0 */
#define FMC_OBCTL1_WP1_L               BITS(16,27)                                     /*!< erase/program protection of low 12 sectors of bank1 when DRP is 0 */

/* FMC_PECFG */
#define FMC_PECFG_PE_ADDR              BITS(0,28)                                      /*!< page address (4KB alignment) */
#define FMC_PECFG_PE_EN                BIT(31)                                         /*!< the enable bit of page erase function */

/* FMC_PEKEY */
#define FMC_PEKEY_PE_KEY               BITS(0,31)                                      /*!< FMC_PECFG unlock key value */

/* FMC_OTP1CFG */
#define FMC_OTP1CFG_OTP1REN            BITS(0,15)                                      /*!< FMC OTP1 read enable bits */

/* FMC_LDECCADDR0 */
#define FMC_LDECCADDR0_LDECCADDR0      BITS(0,31)                                      /*!< ECC two bits error address0 when load code from flash/bootloader/OTP1 */

/* FMC_LDECCADDR1 */
#define FMC_LDECCADDR1_LDECCADDR1      BITS(0,31)                                      /*!< ECC two bits error address1 when load code from flash/bootloader/OTP1 */

/* FMC_LDECCADDR2 */
#define FMC_LDECCADDR2_LDECCADDR2      BITS(0,31)                                      /*!< ECC two bits error address2 when load code from flash/bootloader/OTP1 */

/* FMC_OBSTAT */
#define FMC_OB_SPCL                    BIT(1)                                          /*!< security protection is level low */
#define FMC_OB_SPCH                    BIT(2)                                          /*!< security protection is level high */

/* FMC_PID */
#define FMC_PID_PID                    BITS(0,31)                                      /*!< product ID bits */

