gw826943555/hal_gigadevice/gd32f527/standard_peripheral/include/gd32f527_fmc.h
/* EFUSE_CS */
#define EFUSE_CS_EFSTR             BIT(0)                                              /*!< start efuse operation */
#define EFUSE_CS_EFRW              BIT(1)                                              /*!< the selection of efuse operation */
#define EFUSE_CS_EFBYP             BIT(2)                                              /*!< EFUSE program supply selection */
#define EFUSE_CS_PGIF              BIT(16)                                             /*!< program operation complete flag */
#define EFUSE_CS_RDIF              BIT(17)                                             /*!< read operation complete flag */
#define EFUSE_CS_OVBERIF           BIT(18)                                             /*!< overstep boundary error flag */
#define EFUSE_CS_PGIE              BIT(20)                                             /*!< enable bit for program operation completed interrupt */
#define EFUSE_CS_RDIE              BIT(21)                                             /*!< enable bit for read operation completed interrupt */
#define EFUSE_CS_OVBERIE           BIT(22)                                             /*!< enable bit for overstep boundary error interrupt */
#define EFUSE_CS_PGIC              BIT(24)                                             /*!< clear bit for program operation completed interrupt flag */
#define EFUSE_CS_RDIC              BIT(25)                                             /*!< clear bit for read operation completed interrupt flag */
#define EFUSE_CS_OVBERIC           BIT(26)                                             /*!< clear bit for overstep boundary error interrupt flag */

/* EFUSE_ADDR */
#define EFUSE_ADDR_EFADDR          BITS(0,4)                                           /*!< read or program efuse data start address */
#define EFUSE_ADDR_EFSIZE          BITS(8,12)                                          /*!< read or program efuse data size */

/* EFUSE_CTL */
#define EFUSE_CTL_EFSPC            BIT(0)                                              /*!< EFUSE security protection level */
#define EFUSE_CTL_NDBG             BIT(1)                                              /*!< debugging permission setting */
#define EFUSE_CTL_NBTSB            BIT(2)                                              /*!< not boot from sram or bootloader */
#define EFUSE_CTL_BTFOSEL          BIT(3)                                              /*!< select boot from flash or OTP1 when NBTSB is 1 or BOOT0 is 0 */
#define EFUSE_CTL_UDLK             BIT(6)                                              /*!< EFUSE_USER_DATA register lock bit */
#define EFUSE_CTL_LK               BIT(7)                                              /*!< EFUSE_CTL register lock bit */

/* EFUSE_USER_DATA */
#define EFUSE_USER_DATA_USERDATA   BITS(0,7)                                           /*!< EFUSE USER_DATA value */

/* unlock key */
#define UNLOCK_KEY0                    ((uint32_t)0x45670123U)                             /*!< unlock key 0 */
#define UNLOCK_KEY1                    ((uint32_t)0xCDEF89ABU)                             /*!< unlock key 1 */
#define UNLOCK_PE_KEY                  ((uint32_t)0xA9B8C7D6U)                             /*!< unlock page erase function key */

#define OB_UNLOCK_KEY0                 ((uint32_t)0x08192A3BU)                             /*!< ob unlock key 0 */
#define OB_UNLOCK_KEY1                 ((uint32_t)0x4C5D6E7FU)                             /*!< ob unlock key 1 */

/* option byte BOR threshold value */
#define OBCTL0_BOR_TH(regval)          (BITS(2,3) & ((uint32_t)(regval)) << 2U)
#define OB_BOR_TH_VALUE3               OBCTL0_BOR_TH(0)                                     /*!< BOR threshold value 3 */
#define OB_BOR_TH_VALUE2               OBCTL0_BOR_TH(1)                                     /*!< BOR threshold value 2 */
#define OB_BOR_TH_VALUE1               OBCTL0_BOR_TH(2)                                     /*!< BOR threshold value 1 */
#define OB_BOR_TH_OFF                  OBCTL0_BOR_TH(3)                                     /*!< no BOR function */

/* option byte boot bank value */
#define OBCTL0_BB(regval)              (BIT(4) & ((uint32_t)(regval) << 4U))
#define OB_BB_DISABLE                  OBCTL0_BB(0)                                         /*!< boot from bank0 */
#define OB_BB_ENABLE                   OBCTL0_BB(1)                                         /*!< boot from bank1 or bank0 if bank1 is void */

/* option byte software/hardware free watch dog timer */
#define OBCTL0_NWDG_HW(regval)         (BIT(5) & ((uint32_t)(regval)) << 5U)
#define OB_FWDGT_SW                    OBCTL0_NWDG_HW(1)                                    /*!< software free watchdog */
#define OB_FWDGT_HW                    OBCTL0_NWDG_HW(0)                                    /*!< hardware free watchdog */

/* option byte reset or not entering deep sleep mode */
#define OBCTL0_NRST_DPSLP(regval)      (BIT(6) & ((uint32_t)(regval)) << 6U)
#define OB_DEEPSLEEP_NRST              OBCTL0_NRST_DPSLP(1)                                 /*!< no reset when entering deepsleep mode */
#define OB_DEEPSLEEP_RST               OBCTL0_NRST_DPSLP(0)                                 /*!< generate a reset instead of entering deepsleep mode */

/* option byte reset or not entering standby mode */
#define OBCTL0_NRST_STDBY(regval)      (BIT(7) & ((uint32_t)(regval)) << 7U)
#define OB_STDBY_NRST                  OBCTL0_NRST_STDBY(1)                                 /*!< no reset when entering deepsleep mode */
#define OB_STDBY_RST                   OBCTL0_NRST_STDBY(0)                                 /*!< generate a reset instead of entering standby mode */

/* option byte sram/flash ECC configure */
#define OBCTL0_ECCEN(regval)           (BIT(28) & ((uint32_t)(regval) << 28U))
#define OB_ECC_DISABLE                 OBCTL0_ECCEN(0)                                      /*!< sram/flash ECC disable */
#define OB_ECC_ENABLE                  OBCTL0_ECCEN(1)                                      /*!< sram/flash ECC enable */

/* option byte no waiting time area select */
#define OBCTL0_NWA(regval)             (BIT(29) & ((uint32_t)(regval) << 29U))
#define OB_NWA_BANK1                   OBCTL0_NWA(0)                                      /*!< bank1 is no waiting time area */
#define OB_NWA_BANK0                   OBCTL0_NWA(1)                                      /*!< bank0 is no waiting time area */

/* read protect configure */
#define FMC_NSPC                       ((uint8_t)0xAAU)                                     /*!< no security protection */
#define FMC_LSPC                       ((uint8_t)0xBBU)                                     /*!< low security protection */
#define FMC_HSPC                       ((uint8_t)0xCCU)                                     /*!< high security protection */

/* option bytes write protection */
#define OB_WP_0                        ((uint64_t)0x0000000000000001U)                      /*!< erase/program protection of sector 0  */
#define OB_WP_1                        ((uint64_t)0x0000000000000002U)                      /*!< erase/program protection of sector 1  */
#define OB_WP_2                        ((uint64_t)0x0000000000000004U)                      /*!< erase/program protection of sector 2  */
#define OB_WP_3                        ((uint64_t)0x0000000000000008U)                      /*!< erase/program protection of sector 3  */
#define OB_WP_4                        ((uint64_t)0x0000000000000010U)                      /*!< erase/program protection of sector 4  */
#define OB_WP_5                        ((uint64_t)0x0000000000000020U)                      /*!< erase/program protection of sector 5  */
#define OB_WP_6                        ((uint64_t)0x0000000000000040U)                      /*!< erase/program protection of sector 6  */
#define OB_WP_7                        ((uint64_t)0x0000000000000080U)                      /*!< erase/program protection of sector 7  */
#define OB_WP_8                        ((uint64_t)0x0000000000000100U)                      /*!< erase/program protection of sector 8  */
#define OB_WP_9                        ((uint64_t)0x0000000000000200U)                      /*!< erase/program protection of sector 9  */
#define OB_WP_10                       ((uint64_t)0x0000000000000400U)                      /*!< erase/program protection of sector 10 */
#define OB_WP_11                       ((uint64_t)0x0000000000000800U)                      /*!< erase/program protection of sector 11 */
#define OB_WP_12                       ((uint64_t)0x0000000000001000U)                      /*!< erase/program protection of sector 12 */
#define OB_WP_13                       ((uint64_t)0x0000000000002000U)                      /*!< erase/program protection of sector 13 */
#define OB_WP_14                       ((uint64_t)0x0000000000004000U)                      /*!< erase/program protection of sector 14 */
#define OB_WP_15                       ((uint64_t)0x0000000000008000U)                      /*!< erase/program protection of sector 15 */
#define OB_WP_16                       ((uint64_t)0x0000000000010000U)                      /*!< erase/program protection of sector 16 */
#define OB_WP_17                       ((uint64_t)0x0000000000020000U)                      /*!< erase/program protection of sector 17 */
#define OB_WP_18                       ((uint64_t)0x0000000000040000U)                      /*!< erase/program protection of sector 18 */
#define OB_WP_19                       ((uint64_t)0x0000000000080000U)                      /*!< erase/program protection of sector 19 */
#define OB_WP_20                       ((uint64_t)0x0000000000100000U)                      /*!< erase/program protection of sector 20 */
#define OB_WP_21                       ((uint64_t)0x0000000000200000U)                      /*!< erase/program protection of sector 21 */
#define OB_WP_22                       ((uint64_t)0x0000000000400000U)                      /*!< erase/program protection of sector 22 */
#define OB_WP_23                       ((uint64_t)0x0000000000800000U)                      /*!< erase/program protection of sector 23 */
#define OB_WP_24                       ((uint64_t)0x0000000001000000U)                      /*!< erase/program protection of sector 24 */
#define OB_WP_25                       ((uint64_t)0x0000000002000000U)                      /*!< erase/program protection of sector 25 */
#define OB_WP_26                       ((uint64_t)0x0000000004000000U)                      /*!< erase/program protection of sector 26 */
#define OB_WP_27                       ((uint64_t)0x0000000008000000U)                      /*!< erase/program protection of sector 27 */
#define OB_WP_28                       ((uint64_t)0x0000000010000000U)                      /*!< erase/program protection of sector 28 */
#define OB_WP_29                       ((uint64_t)0x0000000020000000U)                      /*!< erase/program protection of sector 29 */
#define OB_WP_30                       ((uint64_t)0x0000000040000000U)                      /*!< erase/program protection of sector 30 */
#define OB_WP_31                       ((uint64_t)0x0000000080000000U)                      /*!< erase/program protection of sector 31 */
#define OB_WP_32                       ((uint64_t)0x0000000100000000U)                      /*!< erase/program protection of sector 32 */
#define OB_WP_33                       ((uint64_t)0x0000000200000000U)                      /*!< erase/program protection of sector 33 */
#define OB_WP_34                       ((uint64_t)0x0000000400000000U)                      /*!< erase/program protection of sector 34 */
#define OB_WP_35                       ((uint64_t)0x0000000800000000U)                      /*!< erase/program protection of sector 35 */
#define OB_WP_36                       ((uint64_t)0x0000001000000000U)                      /*!< erase/program protection of sector 36 */
#define OB_WP_37                       ((uint64_t)0x0000002000000000U)                      /*!< erase/program protection of sector 37 */
#define OB_WP_38                       ((uint64_t)0x0000004000000000U)                      /*!< erase/program protection of sector 38 */
#define OB_WP_39_53                    ((uint64_t)0x0000008000000000U)                      /*!< erase/program protection of sector 39~53 */
#define OB_WP_ALL                      ((uint64_t)0x000000FFFFFFFFFFU)                      /*!< erase/program protection of all sectors */

/* option bytes CBUS read protection */
#define OB_DRP_0                       ((uint64_t)0x0000000000000001U)                      /*!< CBUS read protection protection of sector 0  */
#define OB_DRP_1                       ((uint64_t)0x0000000000000002U)                      /*!< CBUS read protection protection of sector 1  */
#define OB_DRP_2                       ((uint64_t)0x0000000000000004U)                      /*!< CBUS read protection protection of sector 2  */
#define OB_DRP_3                       ((uint64_t)0x0000000000000008U)                      /*!< CBUS read protection protection of sector 3  */
#define OB_DRP_4                       ((uint64_t)0x0000000000000010U)                      /*!< CBUS read protection protection of sector 4  */
#define OB_DRP_5                       ((uint64_t)0x0000000000000020U)                      /*!< CBUS read protection protection of sector 5  */
#define OB_DRP_6                       ((uint64_t)0x0000000000000040U)                      /*!< CBUS read protection protection of sector 6  */
#define OB_DRP_7                       ((uint64_t)0x0000000000000080U)                      /*!< CBUS read protection protection of sector 7  */
#define OB_DRP_8                       ((uint64_t)0x0000000000000100U)                      /*!< CBUS read protection protection of sector 8  */
#define OB_DRP_9                       ((uint64_t)0x0000000000000200U)                      /*!< CBUS read protection protection of sector 9  */
#define OB_DRP_10                      ((uint64_t)0x0000000000000400U)                      /*!< CBUS read protection protection of sector 10 */
#define OB_DRP_11                      ((uint64_t)0x0000000000000800U)                      /*!< CBUS read protection protection of sector 11 */
#define OB_DRP_12                      ((uint64_t)0x0000000000001000U)                      /*!< CBUS read protection protection of sector 12 */
#define OB_DRP_13                      ((uint64_t)0x0000000000002000U)                      /*!< CBUS read protection protection of sector 13 */
#define OB_DRP_14                      ((uint64_t)0x0000000000004000U)                      /*!< CBUS read protection protection of sector 14 */
#define OB_DRP_15                      ((uint64_t)0x0000000000008000U)                      /*!< CBUS read protection protection of sector 15 */
#define OB_DRP_16                      ((uint64_t)0x0000000000010000U)                      /*!< CBUS read protection protection of sector 16 */
#define OB_DRP_17                      ((uint64_t)0x0000000000020000U)                      /*!< CBUS read protection protection of sector 17 */
#define OB_DRP_18                      ((uint64_t)0x0000000000040000U)                      /*!< CBUS read protection protection of sector 18 */
#define OB_DRP_19                      ((uint64_t)0x0000000000080000U)                      /*!< CBUS read protection protection of sector 19 */
#define OB_DRP_20                      ((uint64_t)0x0000000000100000U)                      /*!< CBUS read protection protection of sector 20 */
#define OB_DRP_21                      ((uint64_t)0x0000000000200000U)                      /*!< CBUS read protection protection of sector 21 */
#define OB_DRP_22                      ((uint64_t)0x0000000000400000U)                      /*!< CBUS read protection protection of sector 22 */
#define OB_DRP_23                      ((uint64_t)0x0000000000800000U)                      /*!< CBUS read protection protection of sector 23 */
#define OB_DRP_24                      ((uint64_t)0x0000000001000000U)                      /*!< CBUS read protection protection of sector 24 */
#define OB_DRP_25                      ((uint64_t)0x0000000002000000U)                      /*!< CBUS read protection protection of sector 25 */
#define OB_DRP_26                      ((uint64_t)0x0000000004000000U)                      /*!< CBUS read protection protection of sector 26 */
#define OB_DRP_27                      ((uint64_t)0x0000000008000000U)                      /*!< CBUS read protection protection of sector 27 */
#define OB_DRP_28                      ((uint64_t)0x0000000010000000U)                      /*!< CBUS read protection protection of sector 28 */
#define OB_DRP_29                      ((uint64_t)0x0000000020000000U)                      /*!< CBUS read protection protection of sector 29 */
#define OB_DRP_30                      ((uint64_t)0x0000000040000000U)                      /*!< CBUS read protection protection of sector 30 */
#define OB_DRP_31                      ((uint64_t)0x0000000080000000U)                      /*!< CBUS read protection protection of sector 31 */
#define OB_DRP_32                      ((uint64_t)0x0000000100000000U)                      /*!< CBUS read protection protection of sector 32 */
#define OB_DRP_33                      ((uint64_t)0x0000000200000000U)                      /*!< CBUS read protection protection of sector 33 */
#define OB_DRP_34                      ((uint64_t)0x0000000400000000U)                      /*!< CBUS read protection protection of sector 34 */
#define OB_DRP_35                      ((uint64_t)0x0000000800000000U)                      /*!< CBUS read protection protection of sector 35 */
#define OB_DRP_36                      ((uint64_t)0x0000001000000000U)                      /*!< CBUS read protection protection of sector 36 */
#define OB_DRP_37                      ((uint64_t)0x0000002000000000U)                      /*!< CBUS read protection protection of sector 37 */
#define OB_DRP_38                      ((uint64_t)0x0000004000000000U)                      /*!< CBUS read protection protection of sector 38 */
#define OB_DRP_39_53                   ((uint64_t)0x0000008000000000U)                      /*!< CBUS read protection protection of sector 39~53 */
#define OB_DRP_ALL                     ((uint64_t)0x000000FFFFFFFFFFU)                      /*!< CBUS read protection protection of all sectors */

