gw826943555/hal_gigadevice/gd32f527/standard_peripheral/include/gd32f527_fmc.h
/* option bytes CBUS read protection mode */
#define OBCTL0_DRP(regval)             (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_DRP_DISABLE                 OBCTL0_DRP(0)                                        /*!< the WPx bits used as erase/program protection of each sector */
#define OB_DRP_ENABLE                  OBCTL0_DRP(1)                                        /*!< the WPx bits used as erase/program protection and CBUS read protection of each sector */

/* FMC sectors */
#define SN_5                           FMC_CTL_SN_5                                         /* bit 5 of sector number */
#define CTL_SN(regval)                 (BITS(3,7) & ((uint32_t)(regval)) << 3)
#define CTL_SECTOR_NUMBER_0            CTL_SN(0)                                            /*!< sector 0  */
#define CTL_SECTOR_NUMBER_1            CTL_SN(1)                                            /*!< sector 1  */
#define CTL_SECTOR_NUMBER_2            CTL_SN(2)                                            /*!< sector 2  */
#define CTL_SECTOR_NUMBER_3            CTL_SN(3)                                            /*!< sector 3  */
#define CTL_SECTOR_NUMBER_4            CTL_SN(4)                                            /*!< sector 4  */
#define CTL_SECTOR_NUMBER_5            CTL_SN(5)                                            /*!< sector 5  */
#define CTL_SECTOR_NUMBER_6            CTL_SN(6)                                            /*!< sector 6  */
#define CTL_SECTOR_NUMBER_7            CTL_SN(7)                                            /*!< sector 7  */
#define CTL_SECTOR_NUMBER_8            CTL_SN(8)                                            /*!< sector 8  */
#define CTL_SECTOR_NUMBER_9            CTL_SN(9)                                            /*!< sector 9  */
#define CTL_SECTOR_NUMBER_10           CTL_SN(10)                                           /*!< sector 10 */
#define CTL_SECTOR_NUMBER_11           CTL_SN(11)                                           /*!< sector 11 */
#define CTL_SECTOR_NUMBER_12           CTL_SN(12)                                           /*!< sector 12 */
#define CTL_SECTOR_NUMBER_13           CTL_SN(13)                                           /*!< sector 13 */
#define CTL_SECTOR_NUMBER_14           CTL_SN(14)                                           /*!< sector 14 */
#define CTL_SECTOR_NUMBER_15           CTL_SN(15)                                           /*!< sector 15 */
#define CTL_SECTOR_NUMBER_16           CTL_SN(16)                                           /*!< sector 16 */
#define CTL_SECTOR_NUMBER_17           CTL_SN(17)                                           /*!< sector 17 */
#define CTL_SECTOR_NUMBER_18           CTL_SN(18)                                           /*!< sector 18 */
#define CTL_SECTOR_NUMBER_19           CTL_SN(19)                                           /*!< sector 19 */
#define CTL_SECTOR_NUMBER_20           CTL_SN(20)                                           /*!< sector 20 */
#define CTL_SECTOR_NUMBER_21           CTL_SN(21)                                           /*!< sector 21 */
#define CTL_SECTOR_NUMBER_22           CTL_SN(22)                                           /*!< sector 22 */
#define CTL_SECTOR_NUMBER_23           CTL_SN(23)                                           /*!< sector 23 */
#define CTL_SECTOR_NUMBER_24           CTL_SN(24)                                           /*!< sector 24 */
#define CTL_SECTOR_NUMBER_25           CTL_SN(25)                                           /*!< sector 25 */
#define CTL_SECTOR_NUMBER_26           CTL_SN(26)                                           /*!< sector 26 */
#define CTL_SECTOR_NUMBER_27           CTL_SN(27)                                           /*!< sector 27 */
#define CTL_SECTOR_NUMBER_28           CTL_SN(28)                                           /*!< sector 28 */
#define CTL_SECTOR_NUMBER_29           CTL_SN(29)                                           /*!< sector 29 */
#define CTL_SECTOR_NUMBER_30           CTL_SN(30)                                           /*!< sector 30 */
#define CTL_SECTOR_NUMBER_31           CTL_SN(31)                                           /*!< sector 31 */
#define CTL_SECTOR_NUMBER_32           (SN_5 | CTL_SN(0))                                   /*!< sector 32 */
#define CTL_SECTOR_NUMBER_33           (SN_5 | CTL_SN(1))                                   /*!< sector 33 */
#define CTL_SECTOR_NUMBER_34           (SN_5 | CTL_SN(2))                                   /*!< sector 34 */
#define CTL_SECTOR_NUMBER_35           (SN_5 | CTL_SN(3))                                   /*!< sector 35 */
#define CTL_SECTOR_NUMBER_36           (SN_5 | CTL_SN(4))                                   /*!< sector 36 */
#define CTL_SECTOR_NUMBER_37           (SN_5 | CTL_SN(5))                                   /*!< sector 37 */
#define CTL_SECTOR_NUMBER_38           (SN_5 | CTL_SN(6))                                   /*!< sector 38 */
#define CTL_SECTOR_NUMBER_39           (SN_5 | CTL_SN(7))                                   /*!< sector 39 */
#define CTL_SECTOR_NUMBER_40           (SN_5 | CTL_SN(8))                                   /*!< sector 40 */
#define CTL_SECTOR_NUMBER_41           (SN_5 | CTL_SN(9))                                   /*!< sector 41 */
#define CTL_SECTOR_NUMBER_42           (SN_5 | CTL_SN(10))                                  /*!< sector 42 */
#define CTL_SECTOR_NUMBER_43           (SN_5 | CTL_SN(11))                                  /*!< sector 43 */
#define CTL_SECTOR_NUMBER_44           (SN_5 | CTL_SN(12))                                  /*!< sector 44 */
#define CTL_SECTOR_NUMBER_45           (SN_5 | CTL_SN(13))                                  /*!< sector 45 */
#define CTL_SECTOR_NUMBER_46           (SN_5 | CTL_SN(14))                                  /*!< sector 46 */
#define CTL_SECTOR_NUMBER_47           (SN_5 | CTL_SN(15))                                  /*!< sector 47 */
#define CTL_SECTOR_NUMBER_48           (SN_5 | CTL_SN(16))                                  /*!< sector 48 */
#define CTL_SECTOR_NUMBER_49           (SN_5 | CTL_SN(17))                                  /*!< sector 49 */
#define CTL_SECTOR_NUMBER_50           (SN_5 | CTL_SN(18))                                  /*!< sector 50 */
#define CTL_SECTOR_NUMBER_51           (SN_5 | CTL_SN(19))                                  /*!< sector 51 */
#define CTL_SECTOR_NUMBER_52           (SN_5 | CTL_SN(20))                                  /*!< sector 52 */
#define CTL_SECTOR_NUMBER_53           (SN_5 | CTL_SN(21))                                  /*!< sector 53 */

/* FMC program size */
#define CTL_PSZ(regval)                (BITS(8,9) & ((uint32_t)(regval)) << 8U)
#define CTL_PSZ_BYTE                   CTL_PSZ(0)                                           /*!< FMC program by byte access */
#define CTL_PSZ_HALF_WORD              CTL_PSZ(1)                                           /*!< FMC program by half-word access */
#define CTL_PSZ_WORD                   CTL_PSZ(2)                                           /*!< FMC program by word access */

/* FMC interrupt enable */
#define FMC_INT_END                    FMC_CTL_ENDIE                              /*!< enable FMC end of program interrupt */
#define FMC_INT_ERR                    FMC_CTL_ERRIE                              /*!< enable FMC error interrupt */
#define FMC_INT_LDECC                  FMC_CTL_LDECCIE                            /*!< enable FMC load code ECC error interrupt */

/* FMC flags */
#define FMC_FLAG_END                   FMC_STAT_END                                         /*!< FMC end of operation flag bit */
#define FMC_FLAG_OPERR                 FMC_STAT_OPERR                                       /*!< FMC operation error flag bit */
#define FMC_FLAG_LDECCDET              FMC_STAT_LDECCDET                                    /*!< FMC two bits ECC error when load code from flash/OTP1/bootloader */
#define FMC_FLAG_WPERR                 FMC_STAT_WPERR                                       /*!< FMC erase/program protection error flag bit */
#define FMC_FLAG_PGAERR                FMC_STAT_PGAERR                                      /*!< FMC program alignment error flag bit */
#define FMC_FLAG_PGMERR                FMC_STAT_PGMERR                                      /*!< FMC program size not match error flag bit */
#define FMC_FLAG_PGSERR                FMC_STAT_PGSERR                                      /*!< FMC program sequence error flag bit */
#define FMC_FLAG_RDCERR                FMC_STAT_RDCERR                                      /*!< FMC CBUS data read protection error flag bit */
#define FMC_FLAG_BUSY                  FMC_STAT_BUSY                                        /*!< FMC busy flag */

