gw826943555/hal_gigadevice/gd32f527/standard_peripheral/include/gd32f527_fmc.h
/* FMC interrupt flags */
#define FMC_INT_FLAG_END               FMC_STAT_END                                         /*!< FMC end of operation interrupt flag */
#define FMC_INT_FLAG_OPERR             FMC_STAT_OPERR                                       /*!< FMC operation error interrupt flag */
#define FMC_INT_FLAG_LDECCDET          FMC_STAT_LDECCDET                                    /*!< FMC two bits ECC error when load code from flash/OTP1/bootloader interrupt flag */
#define FMC_INT_FLAG_WPERR             FMC_STAT_WPERR                                       /*!< FMC erase/program protection error interrupt flag */
#define FMC_INT_FLAG_PGAERR            FMC_STAT_PGAERR                                      /*!< FMC program alignment error interrupt flag */
#define FMC_INT_FLAG_PGMERR            FMC_STAT_PGMERR                                      /*!< FMC program size not match error interrupt flag */
#define FMC_INT_FLAG_PGSERR            FMC_STAT_PGSERR                                      /*!< FMC program sequence error interrupt flag */
#define FMC_INT_FLAG_RDCERR            FMC_STAT_RDCERR                                      /*!< FMC CBUS data read protection error interrupt flag */

/* FMC time out */
#define FMC_TIMEOUT_COUNT              ((uint32_t)0x4FFFFFFFU)                              /*!< count to judge of FMC timeout */

/* EFUSE flags */
#define EFUSE_PGIF                     EFUSE_CS_PGIF                                    /*!< programming operation completion flag */
#define EFUSE_RDIF                     EFUSE_CS_RDIF                                    /*!< read operation completion flag */
#define EFUSE_OBERIF                   EFUSE_CS_OVBERIF                                 /*!< overstep boundary error flag */

/* EFUSE flags clear */
#define EFUSE_PGIC                     EFUSE_CS_PGIC                                    /*!< clear programming operation completion flag */
#define EFUSE_RDIC                     EFUSE_CS_RDIC                                    /*!< clear read operation completion flag */
#define EFUSE_OBERIC                   EFUSE_CS_OVBERIC                                 /*!< clear overstep boundary error flag */

/* EFUSE interrupt enable */
#define EFUSE_INT_OBER                 EFUSE_CS_OVBERIE                                 /*!< overstep boundary error interrupt enable */
#define EFUSE_INT_PG                   EFUSE_CS_PGIE                                    /*!< programming operation completion interrupt enable */
#define EFUSE_INT_RD                   EFUSE_CS_RDIE                                    /*!< read operation completion interrupt enable */

/* EFUSE interrupt flags */
#define EFUSE_INT_OBERIF               EFUSE_CS_OVBERIF                                 /*!< overstep boundary error interrupt flag */
#define EFUSE_INT_PGIF                 EFUSE_CS_PGIF                                    /*!< programming operation completion interrupt flag */
#define EFUSE_INT_RDIF                 EFUSE_CS_RDIF                                    /*!< read operation completion interrupt flag */

/* EFUSE interrupt flags clear */
#define EFUSE_INT_OBERIC               EFUSE_CS_OVBERIC                                 /*!< clear overstep boundary error interrupt flag */
#define EFUSE_INT_PGIC                 EFUSE_CS_PGIC                                    /*!< clear programming operation completion interrupt flag */
#define EFUSE_INT_RDIC                 EFUSE_CS_RDIC                                    /*!< clear read operation completion interrupt flag */

/* EFUSE macro address */
#define EFUSE_CTL_EFADDR               ((uint32_t)0x00000001U)                              /*!< efuse control address */
#define USER_DATA_EFADDR               ((uint32_t)0x00000002U)                              /*!< user data address */

/* EFUSE time out */
#define EFUSE_TIMEOUT_COUNT            ((uint32_t)0x0000FFFFU)                              /*!< count to judge of EFUSE timeout */

/* OTP0 address */
#define OTP0_DATA_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FFF7800U)                              /*!< OTP0 data block base address */
#define OTP0_LOCK_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FFF7840U)                              /*!< OTP0 lock block base address */

/* OTP1 address */
#define OTP1_DATA_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FF00000U)                              /*!< OTP1 data block base address */
#define OTP1_LOCK_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FF20200U)                              /*!< OTP1 lock block base address */

/* OTP2 address */
#define OTP2_DATA_BLOCK_BASE_ADDRESS   ((uint32_t)0x1FF20000U)                              /*!< OTP2 data block base address */
#define OTP2_WLOCK_BLOCK_BASE_ADDRESS  ((uint32_t)0x1FF20210U)                              /*!< OTP2 write lock block base address */
#define OTP2_RLOCK_BLOCK_BASE_ADDRESS  ((uint32_t)0x1FF20220U)                              /*!< OTP2 read lock block base address */

/* OTP1 data blockx read enable */
#define OTP1_DATA_BLOCK_0                        BIT(0)                      /*!< erase/program protection of sector 0  */
#define OTP1_DATA_BLOCK_1                        BIT(1)                      /*!< erase/program protection of sector 1  */
#define OTP1_DATA_BLOCK_2                        BIT(2)                      /*!< erase/program protection of sector 2  */
#define OTP1_DATA_BLOCK_3                        BIT(3)                      /*!< erase/program protection of sector 3  */
#define OTP1_DATA_BLOCK_4                        BIT(4)                      /*!< erase/program protection of sector 4  */
#define OTP1_DATA_BLOCK_5                        BIT(5)                      /*!< erase/program protection of sector 5  */
#define OTP1_DATA_BLOCK_6                        BIT(6)                      /*!< erase/program protection of sector 6  */
#define OTP1_DATA_BLOCK_7                        BIT(7)                      /*!< erase/program protection of sector 7  */
#define OTP1_DATA_BLOCK_8                        BIT(8)                      /*!< erase/program protection of sector 8  */
#define OTP1_DATA_BLOCK_9                        BIT(9)                      /*!< erase/program protection of sector 9  */
#define OTP1_DATA_BLOCK_10                       BIT(10)                     /*!< erase/program protection of sector 10 */
#define OTP1_DATA_BLOCK_11                       BIT(11)                     /*!< erase/program protection of sector 11 */
#define OTP1_DATA_BLOCK_12                       BIT(12)                     /*!< erase/program protection of sector 12 */
#define OTP1_DATA_BLOCK_13                       BIT(13)                     /*!< erase/program protection of sector 13 */
#define OTP1_DATA_BLOCK_14                       BIT(14)                     /*!< erase/program protection of sector 14 */
#define OTP1_DATA_BLOCK_15                       BIT(15)                     /*!< erase/program protection of sector 15 */
#define OTP1_DATA_BLOCK_ALL                      BITS(0,15)                  /*!< ALL erase/program protection of sector */

/* constants definitions */
/* fmc state */
typedef enum {
    FMC_READY = 0U,                                                                          /*!< the operation has been completed */
    FMC_BUSY,                                                                               /*!< the operation is in progress */
    FMC_RDCERR,                                                                             /*!< CBUS data read protection error */
    FMC_PGSERR,                                                                             /*!< program sequence error */
    FMC_PGMERR,                                                                             /*!< program size not match error */
    FMC_PGAERR,                                                                             /*!< program alignment error */
    FMC_WPERR,                                                                              /*!< erase/program protection error */
    FMC_OPERR,                                                                              /*!< operation error */
    FMC_LDECCDET,                                                                           /*!< two bits ECC error when load code from flash/OTP1/bootloader */
    FMC_TOERR                                                                               /*!< timeout error */
} fmc_state_enum;

/* EFUSE state */
typedef enum {
    EFUSE_READY = 0U,                                                                       /*!< EFUSE operation has been completed */
    EFUSE_BUSY,                                                                             /*!< EFUSE operation is in progress */
    EFUSE_OBER,                                                                             /*!< EFUSE overstep boundary error */
    EFUSE_TOERR                                                                             /*!< EFUSE timeout error */
} efuse_state_enum;

/* function declarations */
/* FMC main memory programming functions */
/* unlock the main FMC operation */
void fmc_unlock(void);
/* lock the main FMC operation */
void fmc_lock(void);
/* FMC erase page */
fmc_state_enum fmc_page_erase(uint32_t page_addr);
/* FMC erase sector */
fmc_state_enum fmc_sector_erase(uint32_t fmc_sector);
/* FMC erase whole chip */
fmc_state_enum fmc_mass_erase(void);
/* FMC erase whole bank0 */
fmc_state_enum fmc_bank0_erase(void);
/* FMC erase whole bank1(include bank1_ex) */
fmc_state_enum fmc_bank1_erase(void);
/* FMC program a double word at the corresponding address */
fmc_state_enum fmc_doubleword_program(uint32_t address, uint64_t data);
/* FMC program a word at the corresponding address */
fmc_state_enum fmc_word_program(uint32_t address, uint32_t data);
/* FMC program a half word at the corresponding address */
fmc_state_enum fmc_halfword_program(uint32_t address, uint16_t data);
/* FMC program a byte at the corresponding address */
fmc_state_enum fmc_byte_program(uint32_t address, uint8_t data);

/* enable no waitinging time area load after system reset */
void fmc_nwa_enable(void);
/* disable no waiting time area load after system reset */
void fmc_nwa_disable(void);
/* set OTP1 data block not be read */
void otp1_read_disable(uint32_t block);
/* enable read lock block protection for OTP2 */
void otp2_rlock_enable(void);

/* FMC option bytes programming functions */
/* unlock the option byte operation */
void ob_unlock(void);
/* lock the option byte operation */
void ob_lock(void);
/* send option byte change command */
void ob_start(void);
/* erase option byte */
void ob_erase(void);
/* enable write protect */
ErrStatus ob_write_protection_enable(uint64_t ob_wp);
/* disable write protect */
ErrStatus ob_write_protection_disable(uint64_t ob_wp);
/* enable erase/program protection and CBUS read protection */
void ob_drp_enable(uint64_t ob_drp);
/* disable all erase/program protection and CBUS read protection */
void ob_drp_disable(void);
/* configure security protection level */
void ob_security_protection_config(uint8_t ob_spc);
/* program the FMC user option byte */
void ob_user_write(uint32_t ob_fwdgt, uint32_t ob_deepsleep, uint32_t ob_stdby);
/* program the option byte BOR threshold value */
void ob_user_bor_threshold(uint32_t ob_bor_th);
/* configure the option byte boot bank value */
void ob_boot_mode_config(uint32_t boot_mode);
/* configure FMC/SRAM ECC checking, only valid after power reset */
void ob_ecc_config(uint32_t ecc_config);
/* select no waiting time area, only valid after power reset, only for 4MB dual bank series */
void ob_nwa_select(uint32_t nwa_select);
/* get the FMC user option byte */
uint8_t ob_user_get(void);
/* get the FMC option byte write protection of bank0 */
uint32_t ob_write_protection0_get(void);
/* get the FMC option byte write protection of bank1 */
uint32_t ob_write_protection1_get(void);
/* get the FMC erase/program protection and CBUS read protection option bytes value of bank0 */
uint32_t ob_drp0_get(void);
/* get the FMC erase/program protection and CBUS read protection option bytes value of bank1 */
uint32_t ob_drp1_get(void);
/* get option byte security protection code value */
FlagStatus ob_spc_get(void);
/* get the FMC option byte BOR threshold value */
uint32_t ob_user_bor_threshold_get(void);
/* get the boot mode */
uint32_t ob_boot_mode_get(void);
/* get FMC/SRAM ECC checking */
uint32_t ob_ecc_get(void);
/* get no waiting time area */
uint32_t ob_nwa_get(void);

/* FMC interrupts and flags management functions */
/* get flag set or reset */
FlagStatus fmc_flag_get(uint32_t fmc_flag);
/* clear the FMC pending flag */
void fmc_flag_clear(uint32_t fmc_flag);
/* enable FMC interrupt */
void fmc_interrupt_enable(uint32_t fmc_int);
/* disable FMC interrupt */
void fmc_interrupt_disable(uint32_t fmc_int);
/* get FMC interrupt flag set or reset */
FlagStatus fmc_interrupt_flag_get(uint32_t fmc_int_flag);
/* clear the FMC interrupt flag */
void fmc_interrupt_flag_clear(uint32_t fmc_int_flag);
/* get the FMC state */
fmc_state_enum fmc_state_get(void);
/* check whether FMC is ready or not */
fmc_state_enum fmc_ready_wait(uint32_t timeout);

/* EFUSE operation functions */
/* unlock the EFUSE_CTL register */
void efuse_ctrl_unlock(void);
/* lock the EFUSE_CTL register */
void efuse_ctrl_lock(void);
/* unlock the EFUSE_USER_DATA register */
void efuse_user_data_unlock(void);
/* lock the EFUSE_USER_DATA register */
void efuse_user_data_lock(void);
/* read EFUSE value */
efuse_state_enum efuse_read(uint32_t ef_addr, uint32_t size, uint32_t buf[]);
/* write EFUSE */
efuse_state_enum efuse_write(uint32_t ef_addr, uint32_t size, uint8_t ef_data);
/* write efuse control parameter */
efuse_state_enum efuse_control_write(uint8_t ef_data);
/* write user data parameter */
efuse_state_enum efuse_user_data_write(uint8_t ef_data);

/* flag and interrupt functions */
/* check EFUSE flag is set or not */
FlagStatus efuse_flag_get(uint32_t efuse_flag);
/* clear EFUSE pending flag */
void efuse_flag_clear(uint32_t efuse_cflag);
/* enable EFUSE interrupt */
void efuse_interrupt_enable(uint32_t source);
/* disable EFUSE interrupt */
void efuse_interrupt_disable(uint32_t source);
/* check EFUSE interrupt flag is set or not */
FlagStatus efuse_interrupt_flag_get(uint32_t int_flag);
/* clear EFUSE pending interrupt flag */
void efuse_interrupt_flag_clear(uint32_t int_cflag);
/* check EFUSE operation ready or not */
efuse_state_enum efuse_ready_wait(uint32_t efuse_flag, uint32_t timeout);

#endif /* GD32F527_FMC_H */
